Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E23B.tmx
Source language: en_us
Languages: zh_cn

source: How to Choose Your Ukulele!
zh_cn: 如何挑选适合你的尤克里里？

source: Hi there!
zh_cn: 大家好！

source: Are you a beginner trying to find a 'ukulele, but you just can't find the right one?
zh_cn: 你是否刚开始接触尤克里里，并且没有找到一把适合自己的琴呢？

source: First, you have to look at the price.
zh_cn: 首先，你得看看价格。

source: What's your price range?
zh_cn: 你的接受范围是多少？

source: If you can, make sure it's a little over $80.
zh_cn: 如果条件允许，一把80多美元的琴是不错的选择。

source: Most cheap , non-well made 'ukuleles cost less than that.
zh_cn: 多数尤克里里的做工欠佳且比这便宜。

source: Remember: Don't start with a super duper expensive 'uke!
zh_cn: 记住：别一开始就买价格坑爹的琴！

source: Wait till you get better, to move on to more expensive 'ukuleles.
zh_cn: 等你弹得不错了，再买贵一些的琴。

source: Second, what type of 'ukulele do you want?
zh_cn: 第二，你想要哪种型号的尤克里里？

source: A soprano (small, about 21''), a concert (23'', louder), a tenor (26''), or baritone (about 30'')?
zh_cn: 女高音型（小巧，大约21寸），音乐会型（23寸，声音洪亮），男高音型（26寸），或者男中音型（约30寸）。

source: Third (optional) did you want a specific brand of 'ukulele?
zh_cn: 第三，你对品牌有特殊要求吗？

source: I currently have an Ohana Concert 'Ukulele. (I love it, well made!)
zh_cn: 我现在的琴是Ohana C型的。（我很喜欢它，做工很棒！）

source: Fourth, look at where it is made, and the features.
zh_cn: 第四，看看琴是哪里制造的，有哪些特征。

source: Is it handcrafted, made of wood?
zh_cn: 是木质手工的吗？

source: Or is it a cheap plastic one?
zh_cn: 还是便宜的塑料制成的？

source: NOTE: It doesn't have to be the most expensive one to be a great 'ukulele. It doesn't have to be handcrafted either.
zh_cn: 注意：并不是贵的尤克里里才好，也并非手工的才好。

source: Based on my experience, the sound of the plastic 'ukuleles is simply not good, compared to better made products (real wood, etc).
zh_cn: 根据我的经验，塑料制成的尤克里里音质肯定不如做工好一些的产品（比如实木等材料）。

source: Fifth, ask the shop owner if you can try the 'uke out.
zh_cn: 第五，向店主要求试弹。

source: If you aren't comfortable playing it at a store, ask someone at the store who knows.
zh_cn: 如果你觉得在店里弹得不自在，可以让店里的人帮你试弹。

source: Just hold it like you would a 'ukulele, make sure you feel comfortable with it.
zh_cn: 试弹的时候要想象自己会弹琴，要确保琴拿着顺手才行。

source: Sixth, if you can, look at reviews on the 'ukulele you are considering.
zh_cn: 第六，也可以看看你中意的尤克里里的相关评价。

source: Trust me, this may be helpful to see what other people have to say about the 'uke.
zh_cn: 相信我，借鉴别人的评价对你购买尤克里里是有帮助的。

source: Seventh, make sure this is the instrument for you!
zh_cn: 第七，相信这是为你量身定做的乐器！

source: Are you going to teach yourself, take lessons?
zh_cn: 你是打算自学还是找老师教呢？

source: Or are you just going to quit after a month or two?
zh_cn: 或者仅仅玩一两个月就放弃？

source: Make sure you commit to your 'ukulele!
zh_cn: 你要确保对你的尤克里里负责哟！

source: Last but simply not least, make sure your 'ukulele is tuned!
zh_cn: 最后一点也很重要，要调好音！

source: Ask the store owner or someone working at the shop you are buying from, for a tuner!
zh_cn: 向买琴的乐器店的店主或店员要一个调音器！

source: Your new 'ukulele will get out of tune a lot, but this is normal.
zh_cn: 新买的琴音很不准，但这很正常。

source: Once it is tuned enough, it will hold the tune.
zh_cn: 一旦调好了音，声音就会稳定下来。

source: (Also buy a chord sheet if you will use it!)
zh_cn: （如果你需要的话还可以买和弦表！）

source: One last tip: Don't be afraid to ask the employees at the shop about all their 'ukuleles!
zh_cn: 还有一个小提示，要向店主大胆咨询店里所有的尤克里里的信息。

source: If they are willing to help you, accept their help.
zh_cn: 如果他们乐意帮助你，就大方接受。

source: Know as much as you can about your 'uke.
zh_cn: 尽量多了解你想买的尤克里里的信息。

source: Hope you have fun.
zh_cn: 祝你玩得开心！
